{
  "_name_or_path": "ASRModel",
  "architectures": ["ASRModel"],
  "model_type": "asr_model",
  "text_model_id": "HuggingFaceTB/SmolLM3-3B",
  "audio_model_id": "facebook/hubert-xlarge-ls960-ft",
  "attn_implementation": "flash_attention_2",
  "model_dtype": "bfloat16",
  "audio_downsample_rate": 5,
  "system_prompt": "You are a helpful AI assistant.",
  "encoder_dim": 1280,
  "llm_dim": 4096,
  "projector_hidden_dim": 2048
}